{
  "language": "en",
  "basics": {
    "name": "Ales Loncar",
    "image": "picture.png",
    "label": "Software Engineering / DevOps / Cloud Computing Specialist",
    "headline": "Daytime maker of code | Midnight baker / cook | Analog photography enthusiast | Wine sipper & Beer lover | Slovenian expat",
    "summary": "Specialities:\n- \"The Right Tools for the Job\" development philosophy.\n- \"Boy Scout Rule\" - When we make changes to the code base, we should make sure we are leaving it (checking in to repository) cleaner.\n- Encouraging \"Run What You Build\" tenet for improving IT delivery using a DevOps model.\n- Advanced research, problem-solving and improvisational skills.\n- A passionate team player. I am always eager to work with talented teammates.\n- Able to quickly adapt and learn in different environments.\n- Like to learn, experiment and utilize new technologies.",
    "website": "https://loncar.net/",
    "blog": null,
    "yearsOfExperience": 20,
    "id": "c3dd9d7f-955a-45b8-b8ce-d74a2e20a57e",
    "username": "loncarales",
    "email": "ales.loncar@gmail.com",
    "location": {
      "city": "Munich",
      "countryCode": "DE",
      "region": "Bayern"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "loncarales",
        "url": "https://www.linkedin.com/in/loncarales/"
      },
      {
        "network": "GitHub",
        "username": "loncarales",
        "url": "https://github.com/loncarales"
      }
    ]
  },
  "work": [
    {
      "name": "Graylog",
      "position": "Cloud Engineer",
      "website": "https://www.graylog.org/",
      "location": "Remote",
      "summary": "I am a member of the international Cloud Engineering team. We are working to elevate Graylog into a cloud offering and make it the product customers have wanted for years. Some of the mine responsibilities:",
      "keywords": [
        "Terraform + Ansible (Infrastructure as Code)",
        "Prometheus",
        "Grafana",
        "AWS Toolset",
        "Distributed System Architecture",
        "K8s",
        "Argo",
        "Go (golang)",
        "Python",
        "Bash/Shell"
      ],
      "isCurrentRole": true,
      "startDate": "2021-10-01",
      "endDate": "2022-12-31",
      "highlights": [
        "Creating and designing infrastructure architecture and deciding the best design choice between different options",
        "Troubleshooting design flaws and system bottlenecks",
        "Automate/Improve all DevOps/Development/Release processes",
        "Implementation/Development of internal services for monitoring/alerting",
        "Documenting implemented designs and solutions",
        "Proposing, planning and implementing further improvements",
        "Implement best security practices on a cloud infrastructure"
      ]
    },
    {
      "name": "Publicis Sapient",
      "position": "Java Architect",
      "website": "https://www.publicissapient.com/",
      "location": "Remote",
      "summary": "I am working closely with the PS FS team. Together we help the client with digital business transformation, product discovery, increasing agility and accelerating software releases. As part of the backend team, I am deeply involved in Java (Spring Boot) and Cloud-Native Architecture on Microsoft Azure.",
      "keywords": ["Spring Boot", "Microservices", "Bash/Shell", "Docker", "K8s", "Azure"],
      "isCurrentRole": false,
      "startDate": "2020-11-01",
      "endDate": "2021-09-01",
      "highlights": [
        "Creating and designing software architecture and deciding the best design choice between different options",
        "Troubleshooting design flaws and system bottlenecks",
        "Designing and implementing microservice architecture on Azure Kubernetes Service (AKS)",
        "Improving existing Spring Boot microservices using programming paradigms like Aspect-oriented programming, asynchronous behaviour, Domain-driven design (DDD) and hexagonal architecture, Application Events ...",
        "Improving existing CI/CD pipelines in Azure DevOps",
        "Creating software architecture documents and documenting API's programmatically"
      ]
    },
    {
      "name": "Publicis Sapient",
      "position": "Senior DevOps Engineer",
      "website": "https://www.publicissapient.com/",
      "location": "Munich",
      "summary": "Working closely with the client's logistics team to align software project and plan the work with\nthe development/infrastructure team. Helping streamline teams, speed development, increase agility and accelerate software releases. \n\nThe tools we were using are these days buzzwords:\n- Running containerize apps with Docker and OpenShift\n- Cloud Computing With Azure\n- IaC with Ansible, Packer and Terraform\n- Automation, automation, automation",
      "keywords": ["Ansible", "Terraform", "Jenkins", "Bash/Shell", "Docker", "OpenShift", "Azure"],
      "isCurrentRole": false,
      "startDate": "2019-11-01",
      "endDate": "2020-06-01",
      "highlights": [
        "Helping to implement and improving development CI/CD software pipeline",
        "Helping implement new technologies in development for future deployments",
        "Providing technical guidance, knowledge transfers and mentorship to peers as required"
      ]
    },
    {
      "name": "Accenture",
      "position": "Infrastructure Engineer / DevOps Practitioner",
      "website": "https://www.accenture.com/",
      "location": "Munich",
      "startDate": "2018-09-01",
      "endDate": "2019-10-01",
      "isCurrentRole": false,
      "summary": "With my prior knowledge of software engineering and systems, I am providing infrastructure expertise on a team to improve throughput and stability of applications which are running on OpenShift Container Platform.",
      "keywords": [
        "Linux/Unix environment and scripting languages (Bash, Perl)",
        "Go",
        "Docker",
        "Kubernetes",
        "RedHat OpenShift Container Platform",
        "Helm",
        "Ansible",
        "Jenkins",
        "Nexus",
        "SonarQube",
        "Artifactory",
        "Prometheus",
        "Grafana",
        "Terraform",
        "Confluence / Jira / BitBucket",
        "OpenStack"
      ],
      "highlights": [
        "OpenShift Container Platform: Migration of existing applications from traditional server world to the world of containers",
        "OpenShift Container Platform: Implementing CI/CD, testing and monitoring infrastructure in the cluster: Jenkins, SonarQube, Fitnesse, Prometheus, Microservices",
        "OpenShift Container Platform: Applications and persistent volumes migration from different cluster versions (from 3.6 to 3.9)",
        "OpenShift Container Platform: Implementing a complete monitoring suite (Prometheus, Pushgateway, Alert Manager) inside the whole cluster"
      ]
    },
    {
      "name": "Catenate",
      "position": "Senior Software Engineer / Software Development Lead",
      "website": "https://catenate.com/",
      "location": "Munich",
      "startDate": "2018-07-01",
      "endDate": "2019-10-01",
      "isCurrentRole": false,
      "summary": "Working closely with our client's technical leads and management to align software project and plan the work with the software development team. I actively teach, advise, mentor and train during pair programming, code reviews, tech talks, conference calls. Solving day to day problems, mostly not related to business requirements but instead focus on non-functional elements such as maintainability, manageability, scalability, reliability, testability, deployability, and security.",
      "keywords": [
        "Java",
        "Gradle",
        "Confluence / Jira / BitBucket",
        "GitLab",
        "Jenkins",
        "Ansible",
        "Jenkins",
        "Docker"
      ],
      "highlights": [
        "Leading technical discussions and debate issues with the engineering team",
        "I also get my hands dirty cutting code and doing code reviews, meeting with clients, coordination and collaboration to inspiring the team and taking care of that there are no impediments in the projects",
        "Mentoring and training, pair programming",
        "Tech talks: Cloud Computing, Containers and Container orchestration, DevOps Myths and Misconceptions, Vagrant, OpenShift"
      ]
    },
    {
      "name": "Etkon GmbH / Straumann",
      "position": "Software Engineer, CAD/CAM",
      "url": "https://www.straumann.com/",
      "location": "Munich, Germany",
      "startDate": "2016-02",
      "endDate": "2018-06",
      "summary": "Contributed as a core member of the CAD/CAM software development team at Straumann Group, a global leader in dental prosthetics and implant solutions. Led modernization initiatives to integrate contemporary software development practices, DevOps tooling, and automation into legacy systems supporting dental prosthetics manufacturing and 3D data processing workflows. Collaborated with cross-functional teams to develop internal tools, REST APIs, and scalable infrastructure solutions using containerization and orchestration technologies.",
      "keywords": [
        "Perl",
        "PHP",
        "Go",
        "Symfony",
        "Doctrine DBAL",
        "MySQL",
        "Redis",
        "Docker",
        "Kubernetes",
        "Ansible",
        "GitLab CI",
        "Swagger",
        "Mojolicious",
        "Flask",
        "CI/CD",
        "Microservices",
        "Infrastructure as Code",
        "Automation",
        "DevOps"
      ],
      "highlights": [
        "Introduced and integrated modern development practices including TDD (PHPUnit), automated acceptance testing (Selenium), dependency injection, and Composer/Packagist into legacy PHP systems.",
        "Refactored legacy PHP codebase to adopt Symfony components and Doctrine DBAL, replacing deprecated PEAR packages and improving maintainability and performance.",
        "Designed and implemented RESTful APIs using Mojolicious (Perl) and Flask (Python), documented with Swagger (OpenAPI) for integration with CNC machines and internal systems.",
        "Established GitLab CI pipelines with custom GitLab Runners for automated building, testing, and deployment of REST services, enhancing code quality and release speed.",
        "Deployed an internal Docker registry via GitLab to streamline container image management and accelerate development workflows.",
        "Orchestrated infrastructure provisioning using Ansible to automate CI/CD environments on Debian and CoreOS servers, supporting both development and production environments.",
        "Led the transition toward containerization with Docker and initiated the deployment of Kubernetes clusters (staging and production) to improve scalability and reliability.",
        "Implemented front-end build automation using Grunt for CSS and JavaScript minification, concatenation, and bundling to optimize client-side performance.",
        "Delivered internal technical workshops on PHP best practices, automated testing, ACL implementations, and modern DevOps workflows to upskill development team members.",
        "Acted as a mentor and knowledge leader within the team, fostering adoption of new tools, processes, and engineering standards."
      ]
    },    
    {
      "name": "Travian Games GmbH",
      "position": "Senior Developer",
      "url": "https://www.traviangames.com",
      "location": "Munich, Germany",
      "startDate": "2013-03",
      "endDate": "2016-01",
      "summary": "Senior Software Developer with proven expertise in developing tools and communication layers for large-scale online games, contributing to the success of Travian 5. Spearheaded migration from Gitorious to Stash, improving version control processes. Enhanced development workflows through automation and mentoring. Delivered new features and optimized existing systems within an Agile environment, consistently achieving high-quality code standards.",
      "keywords": [
        "Agile",
        "PHP",
        "Zend Framework",
        "JavaScript",
        "AngularJS",
        "Node.js",
        "Git",
        "Stash",
        "SourceTree",
        "Jira",
        "Confluence",
        "Bamboo",
        "MySQL",
        "MongoDB",
        "Redis",
        "Continuous Integration",
        "DevOps",
        "Code Review",
        "Mentoring",
        "Pair Programming",
        "API Development",
        "Software Optimization"
      ],
      "highlights": [
        "Developed and maintained critical tools for Travian 5, improving game integration with third-party services and streamlining manual processes.",
        "Led successful migration of the development team from Gitorious to Stash, increasing repository management efficiency and adoption by 100%.",
        "Performed code reviews to maintain high code quality and ensure adherence to best practices.",
        "Mentored junior developers through pair programming and technical training, fostering a culture of knowledge sharing and continuous improvement.",
        "Actively implemented process improvements, shortening sprint delivery times by 10% through optimized workflows.",
        "Built and refactored scalable backend functionality in PHP, Zend Framework, and Node.js, ensuring system stability for a global user base.",
        "Collaborated in Agile ceremonies, providing accurate sprint estimations and contributing to continuous team improvement.",
        "Implemented and maintained CI/CD pipelines using Bamboo, automating deployment processes and reducing release times by 20%."
      ]
    },
    {
      "name": "Central European Media Enterprises Ltd.",
      "position": "Senior Developer",
      "url": "https://www.cme.net",
      "location": "Ljubljana, Slovenia",
      "startDate": "2011-01",
      "endDate": "2013-02",
      "summary": "Contributed to the development, integration, and deployment of digital media platforms including Voyo, a leading video-on-demand service, and the CME Common Content Platform. Collaborated with cross-functional central and local teams to deliver new features across web, mobile, and Smart TV environments.",
      "keywords": [
        "PHP",
        "Zend Framework",
        "JavaScript",
        "jQuery",
        "Android",
        "Widevine",
        "MySQL",
        "Doctrine",
        "Video Streaming",
        "API Development",
        "Digital Rights Management"
      ],
      "highlights": [
        "Developed and maintained Voyo, a multi-model video-on-demand platform supporting TVOD, AVOD, SVOD, EST, PPV, and live streaming.",
        "Implemented the CME Common Content Platform using Zend Framework to standardize content management across regions.",
        "Created RESTful and JSON-RPC APIs enabling integration with mobile apps, Smart TVs, and set-top boxes.",
        "Built Android applications for phones, tablets, and set-top boxes supporting video playback and content delivery.",
        "Developed custom modules for Wowza Media Server to support streaming workflows.",
        "Integrated Google Widevine DRM into video transcoding pipelines to ensure secure content delivery."
      ]
    },
    {
      "name": "AV studio d.o.o.",
      "position": "Web Developer",
      "url": "https://www.av-studio.si",
      "location": "Ljubljana, Slovenia",
      "startDate": "2000-09",
      "endDate": "2008-11",
      "summary": "Developed custom web applications and maintained AV SiteKit, a proprietary content management system, delivering tailored solutions for diverse clients. Supported network and system administration for internal infrastructure.",
      "keywords": [
        "ASP",
        "MSSQL",
        "JavaScript",
        "XHTML",
        "CSS",
        "Content Management",
        "Web Development",
        "Systems Administration"
      ],
      "highlights": [
        "Developed dynamic web applications using ASP, MSSQL, JavaScript, XHTML, and CSS within the AV SiteKit CMS platform.",
        "Maintained and enhanced the AV SiteKit CMS to support client-specific functionality and integrations.",
        "Provided network and systems administration to ensure platform reliability and security."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "RockOnNet",
      "position": "Developer / Administrator / Editor",
      "url": "https://web.archive.org/web/*/http://www.rockonnet.com",
      "location": "Ljubljana, Slovenia",
      "startDate": "2001-01",
      "endDate": "2016-01",
      "summary": "Founded and led RockOnNet, an online music magazine that became a hub for emerging photographers and writers to share music reviews and commentary. Managed full-stack development, site administration, and editorial operations for over a decade. Migrated the platform from a custom CMS to WordPress to improve content management and scalability. Developed a REST API to integrate content with the Android app 'KjeSeRoka,' which ranked 4th–10th in the Si.mobil Izzivamo ideje competition. Although the site is no longer active, archived content is preserved via the Wayback Machine.",
      "keywords": [
        "PHP",
        "JavaScript",
        "MySQL",
        "Apache",
        "Linux",
        "CMS Development",
        "WordPress Migration",
        "REST API",
        "Android Integration",
        "Content Management",
        "Editorial Management",
        "Mobile App Integration",
        "Photography",
        "Community Building"
      ],
      "highlights": [
        "Developed and maintained a custom CMS using PHP, JavaScript, and MySQL to manage articles, media, and user contributions.",
        "Successfully migrated the platform from a custom-built CMS to WordPress, enhancing usability, content workflows, and scalability.",
        "Created a REST API to feed real-time content to the Android app 'KjeSeRoka,' contributing to the app's recognition as a top 4–10 finalist in the Si.mobil Izzivamo ideje competition.",
        "Administered Linux-based web servers (Apache), ensuring uptime, security, and performance optimization.",
        "Oversaw editorial processes, coordinating a volunteer team of writers and photographers to publish regular music-related content.",
        "Built and nurtured an online community platform for music enthusiasts, fostering user engagement and content sharing.",
        "Managed website redesigns and platform upgrades to enhance user experience and content accessibility."
      ]
    }
  ],
  "education": [
    {
      "institution": "Faculty of Computer and Information Science",
      "studyType": "Software Engineering",
      "startDate": "1994-10",
      "endDate": "1999-07"
    },
    {
      "institution": "Gimnazija Murska Sobota",
      "studyType": "High school diploma",
      "startDate": "1990-09",
      "endDate": "1994-06"
    }
  ],
  "awards": [
    {
      "title": "Top 4–10 Finalist, Izzivamo Ideje Competition",
      "date": "2010-09",
      "awarder": "Si.mobil",
      "summary": "Recognized as a top 4–10 finalist in the national innovation competition 'Izzivamo Ideje' organized by Si.mobil, for developing the Android application 'KjeSeRoka,' designed to connect users with live music events."
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": ["Bash/Shell", "PHP", "Perl", "Python", "Java", "Go (golang)", "JavaScript", "C#"]
    },
    {
      "name": "DevOps Toolset & Technologies",
      "keywords": [
        "Source Control Managment: GitLab, Bitbucket, GitHub, ...",
        "Database Automation: Flyway, Liquibase",
        "Continuous Integration (CI): Jenkins, GitLab CI, Bamboo",
        "Configuration: Ansible, Vagrant, Terraform, Packer",
        "Testing: JUnit, Selenium, PHPUnit",
        "Deployment: GitLab CI",
        "Containers: Docker, Kubernetes, Helm, OpenShift, Rancher",
        "Cloud: AWS, Azure, Google Cloud, OpenStack",
        "AI Ops: Prometheus, Grafana,",
        "Analytics: ElasticSearch, LogStash, Kibana (ELK)",
        "Monitoring: Nagios",
        "Security: SonarQube, Ansible Vault",
        "Repository managers: Sonatype Nexus, JFrog Artifactory",
        "Collaboration: Jira, Confluence, Slack, Trello"
      ]
    },
    {
      "name": "Database",
      "keywords": ["MySQL", "MSSQL", "PostgreSQL", "Redis", "MongoDB"]
    },
    {
      "name": "Operating Systems",
      "keywords": ["Linux", "Unix", "MacOS", "BSD", "Windows"]
    },
    {
      "name": "Networking",
      "keywords": ["TCP / IP", "VPN", "RPC", "HTTP", "Security"]
    }
  ],
  "languages": [
    {
      "language": "Slovenian",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "German",
      "fluency": "Fluent"
    }
  ],
  "certificates": [
    {
      "name": "Cloud DevOps Engineer",
      "date": "2021-03-25",
      "issuer": "Udacity",
      "url": "https://graduation.udacity.com/confirm/YP6JRDKY"
    },
    {
      "name": "CKAD: Certified Kubernetes Application Developer",
      "date": "2020-09-17",
      "issuer": "The Linux Foundation",
      "url": "https://www.credly.com/badges/8da32134-2aad-428d-a1e7-27034885c7f5?source=linked_in_profile"
    },
    {
      "name": "CKA: Certified Kubernetes Administrator",
      "date": "2020-08-12",
      "issuer": "The Linux Foundation",
      "url": "https://www.credly.com/badges/17e50e2e-6f95-4afe-8204-faccea515805?source=linked_in_profile"
    },
    {
      "name": "Architecting with Google Kubernetes Engine",
      "date": "2019-07-25",
      "issuer": "Coursera",
      "url": "https://www.coursera.org/account/accomplishments/specialization/QX4SJ3STA2U6"
    }
  ],
  "interests": [
    {
      "name": "Reading",
      "keywords": ["Epic Fantasy", "Science Fiction", "Fantasy"]
    },
    {
      "name": "Photography",
      "keywords": ["Analog", "Concert", "Black & White"]
    },
    {
      "name": "Cooking | Baking",
      "keywords": ["Homemade", "Made With Love", "Sourdough"]
    }
  ],
  "projects": [
    {
      "name": "Filmido.com",
      "description": "An online platform connecting clients with top-tier wedding photographers and videographers at affordable prices.",
      "highlights": [
        "Designed and led the end-to-end architecture for a scalable, containerized microservices platform deployed on Scaleway cloud.",
        "Implemented Infrastructure as Code (IaC) using Terraform, Ansible, and Packer to automate environment provisioning across development, staging, and production.",
        "Built a CI/CD pipeline in CircleCI automating build, linting, testing, security scanning (Snyk), containerization, and deployment, reducing manual deployment effort by 80%.",
        "Configured Traefik as a reverse proxy and load balancer with automatic SSL certificate management via ACME DNS challenge using Cloudflare.",
        "Integrated Sentry to automate application monitoring and error reporting, enabling faster identification and resolution of production issues."
      ],
      "keywords": [
        "Angular 11",
        "Tailwind CSS",
        "Microservices",
        "Java",
        "Spring Boot",
        "Node.js",
        "Express.js",
        "MongoDB Atlas",
        "Docker",
        "CI/CD",
        "CircleCI",
        "Terraform",
        "Ansible",
        "Packer",
        "Infrastructure as Code",
        "Traefik",
        "ACME DNS",
        "Cloudflare",
        "Sentry",
        "DevOps",
        "Reverse Proxy",
        "Load Balancing",
        "Monitoring",
        "Container Security"
      ],
      "startDate": "2021-05-01",
      "url": "https://filmido.com/",
      "roles": ["Software Architect", "Lead Developer", "DevOps Engineer"]
    }
  ]
}
